{"title": "How to Reserve a Spot for an Event", "content": "If a user asks how to reserve an event:\n\n- Guide them to the CultPass app\n- Instruct them to browse the experience catalog and tap 'Reserve'\n- If it's a premium or limited event, check if reservation confirmation is required via email\n- Remind them to arrive at least 15 minutes early with their QR code visible\n\n**Suggested phrasing:**\n\"You can reserve an experience by opening the CultPass app, selecting your desired event, and tapping 'Reserve'. Be sure to arrive 15 minutes early with your QR code ready.\"", "tags": "reservation, events, booking, attendance"}
{"title": "What's Included in a CultPass Subscription", "content": "Each user is entitled to 4 cultural experiences per month, which may include:\n- Art exhibitions\n- Museum entries\n- Music concerts\n- Film screenings and more\n\nSome premium experiences may require an additional fee (visible in the app).\n\n**Suggested phrasing:**\n\"Your CultPass subscription includes 4 curated experiences each month. You can choose from museums, concerts, film events and more. Premium events may have an extra cost, which is shown during reservation.\"", "tags": "subscription, benefits, pricing, access"}
{"title": "How to Cancel or Pause a Subscription", "content": "Users can manage their subscription via the app > 'My Account' > 'Manage Plan'.\n\n- Cancel: Effective at the end of the billing cycle\n- Pause: Preserves user data, resumes automatically when reactivated\n- Do NOT offer refunds unless approved by support lead\n\n**Suggested phrasing:**\n\"You can cancel or pause your subscription at any time via the 'My Account' section in the CultPass app. Cancelation takes effect at the end of your billing cycle.\"", "tags": "cancelation, pause, subscription, billing"}
{"title": "How to Handle Login Issues?", "content": "Most login issues are resolved with password reset:\n\n- Ask the user to tap 'Forgot Password' on the login screen\n- Ensure they are using the correct registered email\n- If they did not receive the reset email, check spam folder or retry after 10 minutes\n- For persistent login issues, escalate to human support\n\n**Suggested phrasing:**\n\"Try tapping 'Forgot Password' on the login screen. Make sure you're using the email associated with your account. If the email doesn't arrive, check spam or try again in a few minutes.\"", "tags": "login, password, access, escalation"}
{"title": "App Crashes or Freezes", "content": "If the CultPass app is crashing or freezing:\n\n- Ask user to force close the app and restart it\n- Check if they're running the latest app version (Settings > About)\n- Clear app cache: Settings > Storage > Clear Cache\n- Ensure device OS is compatible (iOS 13+ or Android 8+)\n- If issue persists after update and cache clear, reinstall the app\n- For continued problems after reinstall, escalate to technical support team\n\n**Suggested phrasing:**\n\"Let's try force-closing the app and restarting it. Also, please check if you have the latest version installed. If the problem continues, try clearing the app cache from your device settings.\"", "tags": "technical, app, crash, troubleshooting"}
{"title": "QR Code Not Scanning at Venue", "content": "When a user's QR code won't scan at an event venue:\n\n- Check screen brightness (should be at maximum)\n- Ensure they're showing the QR code from within the app (not a screenshot)\n- Verify the reservation is for the correct date and hasn't expired\n- Try regenerating the QR code: Reservations > Select Event > Regenerate Code\n- If code shows as invalid, check reservation status in the system\n- Escalate if reservation is valid but code consistently fails\n\n**Suggested phrasing:**\n\"Please make sure your screen brightness is turned up and you're viewing the QR code directly in the app. If it still doesn't work, try regenerating the code from your reservation details.\"", "tags": "technical, qr-code, reservation, venue, troubleshooting"}
{"title": "Payment Method Update Issues", "content": "If a user cannot add or update their payment method:\n\n- Verify the card is valid and not expired\n- Check that billing address matches the card's registered address\n- Ensure card supports recurring payments\n- Try a different payment method (another card or payment option)\n- Clear browser cache if using web version\n- Payment gateway errors (error codes 400+) require escalation\n\n**Suggested phrasing:**\n\"Please verify your card details and billing address are correct. Make sure the card is valid and supports recurring payments. If you're still having trouble, you might want to try a different payment method.\"", "tags": "billing, payment, credit-card, technical"}
{"title": "Refund Policy and Eligibility", "content": "CultPass refund policy:\n\n- Refunds are ONLY provided when an experience is cancelled by the organizer\n- Automatic refund processing within 5-7 business days\n- User cancellations more than 24 hours before event: quota restored, no refund\n- User no-shows or late cancellations: no refund, quota lost\n- Subscription fees are non-refundable except in cases of billing errors\n- Exception requests require supervisor approval - always escalate\n\n**Suggested phrasing:**\n\"According to our policy, refunds are only available when an experience is cancelled by the organizer. For other situations, I'll need to escalate your request to our support team for review.\"", "tags": "refund, billing, policy, escalation"}
{"title": "Billing Cycle and Invoice Access", "content": "Information about CultPass billing:\n\n- Billing occurs monthly on the subscription start date\n- Invoices available in app: Menu > Billing History\n- Email receipts sent to registered email after each charge\n- Failed payments trigger 3 automatic retry attempts over 7 days\n- After 3 failed attempts, subscription is suspended (not cancelled)\n- Reactivation requires updating payment method and clearing outstanding balance\n\n**Suggested phrasing:**\n\"Your billing occurs monthly on the same date you started your subscription. You can view all invoices in the app under Menu > Billing History, and receipts are also emailed to you.\"", "tags": "billing, invoice, payment, subscription"}
{"title": "Promotional Codes and Discounts", "content": "How to use and troubleshoot promotional codes:\n\n- Apply codes during signup or in My Account > Promotions\n- Codes are case-sensitive and must be entered exactly\n- Common issues: code expired, already used, or minimum requirements not met\n- Some codes are tier-specific (basic vs premium subscribers)\n- First-time user codes only work on new accounts\n- Active promotions displayed in app under Offers section\n\n**Suggested phrasing:**\n\"You can apply promotional codes in the Promotions section of your account. Make sure to enter it exactly as shown. If it's not working, the code may have expired or have specific requirements.\"", "tags": "promotions, discount, billing, codes"}
{"title": "Account Blocked or Suspended", "content": "When a user's account is blocked or suspended:\n\n- Common reasons: payment failure, terms of service violation, fraud detection\n- Payment-related blocks: resolve by updating payment method and clearing balance\n- Policy violations: requires human review - ALWAYS ESCALATE\n- Fraud flags: security team review required - ALWAYS ESCALATE\n- Temporary suspensions vs permanent bans have different resolution paths\n- Do not promise account restoration - only support team can approve\n\n**Suggested phrasing:**\n\"I see your account has been blocked. This requires review by our support team. I'm escalating your case immediately, and they'll contact you within 24 hours to resolve this.\"", "tags": "account, blocked, suspended, security, escalation"}
{"title": "Profile and Preferences Management", "content": "How users can update their account information:\n\n- Edit profile: My Account > Profile Settings\n- Change email: requires verification of both old and new email\n- Update phone number: instant update with SMS confirmation\n- Password requirements: minimum 8 characters, must include number and symbol\n- Notification preferences: My Account > Notifications (email, push, SMS)\n- Deactivate vs Delete: deactivation is temporary, deletion is permanent after 30-day grace period\n\n**Suggested phrasing:**\n\"You can update your profile information in My Account > Profile Settings. For security, email changes require verification. If you want to adjust notification preferences, check the Notifications section.\"", "tags": "account, profile, settings, preferences, password"}
{"title": "Cancelling or Modifying Reservations", "content": "Reservation cancellation and modification policy:\n\n- Cancellations allowed up to 24 hours before event start time\n- Cancel via: My Reservations > Select Event > Cancel Reservation\n- Cancelled reservations restore monthly quota immediately\n- Modifications (date/time changes) not supported - must cancel and rebook\n- No-show policy: quota slot lost, warning issued after 2 no-shows in 30 days\n- Third no-show may result in temporary reservation privileges suspension\n\n**Suggested phrasing:**\n\"You can cancel reservations up to 24 hours before the event through My Reservations. The quota slot will be restored immediately. Note that we can't modify reservations, so you'd need to cancel and make a new booking.\"", "tags": "reservation, cancellation, modification, policy"}
{"title": "Premium Experience Eligibility and Upgrades", "content": "Understanding premium experiences and subscription tiers:\n\n- Premium experiences marked with gold badge in app\n- Basic tier: access to standard experiences, premium requires additional fee\n- Premium tier: includes select premium experiences in monthly quota\n- Upgrade: My Account > Manage Plan > Upgrade to Premium\n- Upgrades prorated - only pay difference for remaining billing cycle\n- Downgrades take effect at next billing cycle (no mid-cycle downgrades)\n- Some exclusive events require Premium tier regardless of additional fees\n\n**Suggested phrasing:**\n\"Premium experiences are marked with a gold badge. With a Basic subscription, these require an additional fee. If you upgrade to Premium, many of these are included in your monthly quota. Upgrades are prorated for the current month.\"", "tags": "premium, subscription, upgrade, tier, benefits"}